import React from 'react';
import styled from '@emotion/styled';

function Terms() {
    return (
        <Container>
            <Title>서비스 이용 약관</Title>
            <Contents>
                서비스 이용 약관
                <br />
                <br />
                제1장 총칙
                <br />
                <br />
                제1조 (목적)
                <br />
                본 약관은 바이덱스(이하 총칭하여 &quot;회사&quot;라 합니다)가 제공하는 인터넷 웹사이트의 서비스(도메인명 www.bydex.com, 이하 &quot;서비스&quot;라 합니다)의 이용과 관련하여 회원과 회사간의 권리, 의무, 책임사항 및 이용조건과 절차 등 기본적인 사항을 규정함을 목적으로 합니다.
                <br />
                <br />
                제2조 (약관의 효력 및 변경)
                <br />
                ① 본 약관은 그 내용을 회사의 웹사이트에 게시하거나 기타의 방법으로 회원에게 공지하고, 이에 동의한 회원이 서비스에 로그인함으로써 효력이 발생합니다.
                <br />
                ② 회사는 &quot;약관의규제에관한법률&quot;, &quot;개인정보보호법&quot;, &quot;정보통신망이용촉진및정보보호등에관한법률&quot; 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있으며, 약관을 개정할 경우에는 개정약관의 적용일자 7일 이전에 제1항과 같은 방법으로 공지합니다. 단, 회원의 권리 또는 의무에 관한 중요한 내용의 변경은 적용일자 30일 이전에 공지합니다.
                <br />
                ③ 회원이 변경된 약관의 효력발생일 이후 계속하여 서비스를 이용하는 경우에는 당해 회원은 약관의 변경사항에 동의한 것으로 간주됩니다.
                <br />
                <br />
                제3조 (약관 외 준칙)
                <br />
                본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법, 개인정보보호법, 정보통신망이용촉진 및 정보보호 등에 관한 법률 등 관련 법령 및 회사가 정한 개별 서비스 이용약관 및 서비스 세부이용지침 등의 규정에 따릅니다.
                <br />
                <br />
                제4조 (용어의 정의)
                <br />
                본 약관에서 사용하는 용어의 정의는 다음과 같습니다. 정의되지 않은 본 약관상 용어의 의미는 일반적인 거래 관행에 의합니다.
                <br />
                1.회원 : 회사와 서비스 이용에 관한 계약을 체결하고 웹사이트 서비스에 로그인한 자를 말합니다.
                <br />
                2.판매자 : 물품을 판매하기 위해 회사의 판매자 등록 절차를 완료한 회원을 말합니다.
                <br />
                3.구매자 : 판매자가 판매하는 물품을 구매하고자 하는 회원을 말합니다.
                <br />
                4.이메일: 회원 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 문자, 숫자 또는 양자의 조합
                <br />
                5.이용계약 : 회원이 서비스를 제공받기 위하여 이 약관으로 회사와 체결하는 계약
                <br />
                6.운영자 : 서비스의 전반적인 관리와 원활한 운영을 위하여 회사에서 선정한 사람
                <br />
                <br />
                제2장 서비스의 내용 및 회원 가입
                <br />
                <br />
                제5조 (서비스 이용 계약)
                <br />
                1.서비스를 이용하고자 하는 고객은 회사 웹사이트(www.bydex.com)의 &quot;로그인&quot; 메뉴에서 약관 동의 절차를 거친 &quot;로그인&quot; 버튼을 누름으로써 이용을 신청합니다.
                <br />
                2.전항의 회원 로그인을 하기 위해서는 간편로그인으로 본인의 구글 계정을 연동하면 됩니다.
                <br />
                3.온라인 로그인 시 전달되는 양식에 기재하는 모든 회원정보는 실제와 일치하는 데이터인 것으로 간주됩니다. 고객 본인이 아닌 경우에는 법적인 보호를 받을 수 없으며, 회사는 당해 고객에 대하여 서비스의 이용을 제한할 수 있습니다.
                <br />
                4.회사가 정한 필수 기재사항을 입력하지 않거나 허위의 정보를 입력하거나 회원가입 신청을 하려는 자가 만 14세 미만일 경우 회원가입 신청이 제한될 수 있습니다.
                <br />
                5.회원이 구매/판매 게시글 등록을 포함한 회사의 서비스 이용을 위해 입력하여 제공한 연락처 포함 개인정보는 로그인한 전 회원에게 공개될 수 있습니다. 회사는 서비스 이용을 위해 회원이 직접 입력한 개인정보에 대해서는 책임을 지지 않습니다. 다만, 회사의 고의에 의한 경우에는 그러하지 아니합니다.
                <br />
                6.회사는 회사의 서비스를 이용하기 위해 회원가입 신청을 한 자가 본 조 제2.항에서 정한 필수 기재사항을 정확하게 입력하고 본 약관에 동의한 경우 원칙적으로 서비스의 이용을 승낙합니다. 다만, 회사는 다음과 같은 사유가 있는 경우 회원가입 신청의 승낙을 거절 또는 보류할 수 있고, 이 경우 회사는 승낙 거절 또는 보류의 사유와 승낙에 필요한 추가 요청 정보 등 관련 사항을 통지합니다.
                <br />
                1)회사의 서비스 제공에 기술적인 문제가 있는 경우
                <br />
                2)회원 자격을 상실하거나 이용 계약이 해지된 적이 있는 경우
                <br />
                3)타인의 명의를 도용한 경우
                <br />
                4)허위의 정보를 기재한 경우
                <br />
                5)기타 회사의 합리적인 판단 하에 필요하다고 인정하는 경우
                <br />
                <br />
                제6조 (판매자 등록)
                <br />
                1.제5조에 따라 회사로부터 회원가입 신청을 승낙받아 이용 계약이 성립된 회원이 회사의 서비스를 이용하여 다른 회원에게 물품을 판매하고자 할 경우 판매자 등록 절차를 거쳐야 합니다.
                <br />
                2.업자가 아닌 판매자가 서비스 이용을 위해 입력하여 제공한 신원정보는 판매자의 물품에 대한 구매 청약을 한 구매자의 요청에 따라 해당 구매자에게 제공될 수 있습니다.
                <br />
                <br />
                제7조(이용 계약의 종료)
                <br />
                1.회원은 이 약관에서 정한 절차에 따라 이용계약을 해지할 수 있습니다. 다만 회원은 회사의 해지 의사를 통지하기 전에 구매 또는 판매 진행 중인 절차를 모두 완료, 철회, 취소하여야 하며, 철회 또는 취소로 인한 불이익은 해당 회원이 부담합니다.
                <br />
                2.회사는 원칙적으로 전항의 이용 계약 해지의 의사 표시를 확인한 후 해당 회원의 게시글과 해당 계정을 삭제하여 해지 절차를 완료해야 합니다. 다만, 다음 각 호의 사유가 있는 경우 이용 계약 해지 절차를 보류할 수 있습니다.
                <br />
                이용 계약 해지의 의사표시를 한 자가 회원 당사자인지 여부를 확인할 수 없는 경우
                <br />
                이용 계약 해지의 의사표시를 한 회원의 구매 또는 판매 진행 중인 거래 절차가 모두 완료되지 않은 경우
                <br />
                구매자에 대한 환불 등으로 인하여 회원이 서비스 이용에 관하여 회사에 변제할 채무가 남아있는 경우
                <br />
                이용 계약 해지의 의사표시를 한 회원에 관한 거래 사기 및 분쟁 문제가 남아 있는 경우
                <br />
                3.회사는 본 약관 또는 운영정책에 따라 특정한 사유가 발생한 경우 회원의 자격을 박탈하고 이용계약을 해지할 수 있습니다.
                <br />
                <br />
                제8조(개인정보의 수집 등)
                <br />
                1.회사는 서비스를 제공하기 위하여 관련 법령의 규정에 따라 회원으로부터 필요한 개인정보를 수집합니다.
                <br />
                2.회사는 이용계약을 위하여 회원이 제공한 정보 외에도 수집목적 또는 이용목적 등을 밝혀 회원으로부터 필요한 정보를 수집 이용할 수 있습니다. 이 경우, 회사는 회원으로부터 정보수집 이용에 대한 동의를 받습니다.
                <br />
                3.회사는 서비스의 원활하고 안정적인 운영 및 서비스 품질의 개선을 위하여 회원 PC 등 단말기 설정 및 사양 정보, 실행중인 프로그램 정보, 회원의 모바일 기기 정보(설정, 사양, 운영체제, 버전 등)를 수집∙활용할 수 있습니다.
                <br />
                <br />
                제3장 서비스의 이용
                <br />
                <br />
                제9조(서비스의 이용)
                <br />
                회사는 서비스 내에서 회원간 물품 거래가 이루어질 수 있도록 온라인 거래 장소와 서비스를 제공합니다. 서비스 내에서 판매되는 물품 중 판매자가 직접 판매하나 위 판매자로부터 회사가 판매 중개를 의뢰받은 물품에 관하여 회사는 거래의 당사자가 아니며 해당 물품의 거래에 대하여 원칙적으로 책임을 부담하지 않습니다.
                <br />
                <br />
                제10조(서비스의 제공)
                <br />
                1.회사는 다음과 같은 서비스를 제공합니다.
                <br />
                코인직거래서비스: 코인직거래서비스는 회사가 회원 각자의 자기결정에 의하여 회원 상호간에 물품매매거래가 이루어질 수 있도록 사이버 거래장소(marketplace)를 온라인으로 제공하는 서비스를 말합니다.
                <br />
                <br />
                제11조(서비스의 변경)
                <br />
                1.회사는 필요에 따라 서비스의 전부 또는 일부를 변경할 수 있습니다.
                <br />
                2.회사가 서비스의 변경, 종료, 신규서비스의 개시 등의 사유가 발생한 경우 회원의 등록된 연락처(문자, e-mail 등)를 통해 상세 내용을 통지할 수 있습니다.
                <br />
                3.전항의 경우 사이트 내 공지사항 페이지 등을 통하여 회원에게 통지할 수 있습니다.
                <br />
                4.회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며 이에 대해 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.
                <br />
                <br />
                제12조(서비스의 이용제한 및 중지)
                <br />
                1.회사는 아래에 해당하는 사유가 발생한 경우에는 이용자의 서비스 이용을 제한하거나 중지시킬 수 있습니다.
                <br />
                회사가 사전에 이용자에게 공지하거나 통지한 경우
                <br />
                이용자가 회사 서비스의 운영을 고의 및 과실로 방해하는 경우
                <br />
                설비 점검, 보수 또는 공사로 인하여 부득이한 경우
                <br />
                천재지변, 국가비상사태, 서비스 설비의 장애 또는 이용의 폭주 등 서비스 이용에 지장이 있을 경우
                <br />
                이용자가 사기 및 악성 글 등 건전한 거래 문화 활성화 방해되는 행동을 했을 경우
                <br />
                기타 중대한 사유로 인해 회사가 서비스 제공이 불가능할 경우
                <br />
                <br />
                제4장 회사와 회원의 책임과 의무
                <br />
                <br />
                제13조(회사의 의무)
                <br />
                1.회사는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하는데 최선을 다하여야 합니다.
                <br />
                2.회사는 회원이 수신 동의를 하지 않은 영리 목적의 광고성 전자우편, 문자메시지 등을 발송하지 아니합니다.
                <br />
                3.회사는 서비스의 제공과 관련하여 알게 된 회원의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않고, 이를 보호하기 위하여 노력합니다.
                <br />
                <br />
                제14조(회원의 의무)
                <br />
                1.회원은 본 약관, 운영정책, 이용안내 사항과 관련 법령을 준수하여야 하며 기타 회사 업무에 방해되는 행위를 하여서는 안 됩니다.
                <br />
                2.회사는 회원이 본 약관 및 운영정책에서 제한 또는 금지하는 행위를 한 경우 해당 회원이 회사로부터 부수적으로 제공받은 포인트 등 혜택의 전부 또는 일부를 회수하거나 계정 접속을 제한 또는 회원 자격을 박탈할 수 있고, 해당 회원의 게시글을 임시 삭제 또는 영구 삭제할 수 있습니다. 이에 따라 회원 자격을 박탈당한 자의 재가입은 제한될 수 있습니다.
                <br />
                3.회사가 전항에 따른 조치를 취할 경우 원칙적으로 사전에 해당 회원에게 통지하나 긴급을 요하는 등 부득이한 사유가 있는 경우 선 조치 후 사후 통지할 수 있습니다.
                <br />
                4.조치의 대상인 회원이 제2항에 따른 회사의 조치에 대하여 이의가 있는 경우 회사에 이의를 신청할 수 있습니다.
                <br />
                <br />
                제15조(이용자 관리)
                <br />
                1.회사는 본 약관 및 상거래의 일반원칙을 위반한 이용자에 대하여 다음과 같은 조치를 할 수 있습니다.
                <br />
                회사가 부가적으로 제공한 혜택의 일부 또는 전부의 회수
                <br />
                특정서비스 이용제한
                <br />
                이용계약의 해지
                <br />
                손해배상의 청구
                <br />
                사이버수사대 수사 요청
                <br />
                2.회사가 정한 조치를 할 경우 회사는 사전에 이용자에게 유선, email 및 기타 다른 방법으로 통보하며, 이용자의 연락이 두절되거나 긴급을 요하는 것과 같이 부득이한 경우 선 조치 후 사후 통보할 수 있습니다.
                <br />
                3.이용자는 본 조에 의한 회사의 조치에 항변 사유가 있는 경우 이에 항변할 수 있습니다.
                <br />
                <br />
                제5장 물품거래서비스의 이용
                <br />
                <br />
                제16조(매매계약의 체결 및 대금 결제)
                <br />
                1.물품의 매매계약은 판매자가 제시한 물품의 판매 조건에 응하여 청약의 의사표시를 하고 이에 대하여 판매자가 승낙의 의사표시를 함으로써 체결됩니다.
                <br />
                2.이용자, 결제대행업체, 금융기관 등과의 사이에 발생한 분쟁은 당사자들 간의 해결을 원칙으로 하며, 회사는 이와 관련해서 어떠한 책임도 지지 않고 해당 대행업체 또는 기관의 약관이 우선됩니다.
                <br />
                3.회사는 회원이 현금, 카드 기타의 방법으로 매매 대금을 결제할 수 있는 방법을 제공합니다.
                <br />
                4.회사는 당사자간 거래 계약 성립 및 대금 지급 과정에 개입하지 않으며, 회사를 통한 대금의 결제취소는 안심결제서비스를 통해 구매한 경우에만 가능합니다. 안심결제서비스를 이용하지 않는 대금 결제 취소에 대하여 원칙적으로 회사는 개입할 수 없고 어떠한 법적인 책임도 지지 않습니다. 단, 판매자의 고의적인 선구매확정 유도 거래 피해의 경우에는 회사의 합리적인 판단에 따라 거래취소 등을 진행할 수 있습니다.
                <br />
                5.매매 대금의 결제와 관련하여 구매자가 입력한 정보 및 그 정보와 관련하여 발생한 책임과 불이익은 전적으로 구매자가 부담하여야 합니다.
                <br />
                6.물품을 주문한 후 일정 기간 내에 매매대금을 결제하지 않을 경우 회사는 당해 주문을 회원의 동의 없이 취소할 수 있습니다.
                <br />
                7.회사는 구매자가 매매대금 결제 시 사용한 결제수단에 대해 정당한 사용권한을 가지고 있는지 여부를 확인할 수 있으며, 이에 대한 확인이 완료될 때까지 거래진행을 중지하거나, 확인이 불가한 해당거래를 취소할 수 있습니다.
                <br />
                8.구매자가 실제로 결제하는 금액은 판매자가 정한 공급원가, 기본이용료, 상품에 적용된 배송비, 옵션상품, 안전결제 수수료 등이 적용된 금액(실구매액)이며 구매자에게 발행되는 구매증빙서(현금영수증, 세금계산서, 신용카드매출전표 등)는 결제금액으로 발행됩니다. 안전결제 수수료의 부담주체, 수수료율은 회사가 공지사항에 게시하거나 해당 서비스 이용안내에서 제시하는 바에 따릅니다.
                <br />
                <br />
                제17조(물품의 배송)
                <br />
                1.안심결제서비스를 이용한 물품거래서비스에 대하여 구매자의 주문에 따른 결제가 완료되면 회사는 판매자가 주문 정보를 확인할 수 있도록 조치를 취하고 판매자는 당해 주문 정보에 따라 배송을 하여야 합니다.
                <br />
                2.판매자는 물품을 발송하기 전에 반드시 주문이 취소되었는지 최종 확인해야 하며 물품발송 후 배송 정보 관련 미입력 건에 대해서 구매자가 회사로 취소요청을 하는 경우 판매자에게 통보 없이 취소될 수 있으며 물품회수에 소요되는 비용은 판매자의 부담이 됩니다.
                <br />
                3.판매자는 배송 중 물품 파손되지 않도록 적절한 포장을 한 후 배송의 증명 또는 조회가 가능한 물류대행(택배)업체에 결제완료 기준 3영업일 내에 접수해야 합니다.
                <br />
                4.판매자가 기한 내에 발송하지 아니하거나, 구매자의 귀책사유가 아닌 배송지 오류 등으로 인해 구매자가 물품을 정상적으로 수령하지 못한 경우 판매자가 그에 관한 모든 책임을 부담하여야 합니다.
                <br />
                5.배송과 관련하여 판매자와 구매자, 배송업체, 금융기관 등과의 사이에 발생한 분쟁은 당사자들 간의 해결을 원칙으로 하며, 회사는 어떠한 책임도 부담하지 않습니다.
                <br />
                <br />
                제18조(반품, 교환)
                <br />
                1.구매자는 안심결제서비스를 이용하여 물품을 거래한 경우 반품이나 교환을 요청할 수 있으며 판매자는 구매자가 반품이나 교환을 요청하는 경우 요청에 따라 반품 또는 교환을 해 주어야 합니다.
                <br />
                2.판매자가 안심결제서비스를 이용한 물품거래에 대하여 구매자의 반품을 제한하고자 하는 경우, 물품페이지 등 구매자가 쉽게 알 수 있는 곳에 반품제한 사유를 게재하여야 합니다. 다만, 판매자가 제시한 사유가 객관적으로 부당하다고 판단되는 경우 전자상거래법에서 규정하는 청약철회의 제한사유가 판매자가 지정한 반품조건에 우선하여 적용됩니다.
                <br />
                3.제1항에도 불구하고, 구매자가 전자상거래법상 통신판매업자인 판매자의 물품을 구매한 경우, 전자상거래법 제17조에 의하여 배송 완료된 날로부터 7일까지 반품신청이 가능하며, 전자상거래법에서 인정하는 청약철회 제한 사유가 있을 경우에만 반품신청을 거부하는 것이 가능합니다.
                <br />
                4.구매자가 반품 신청 시 반품 송장번호를 미기재하거나 반품사유에 관하여 판매자에게 정확히 통보(또는 서면)하지 않을 시 반품처리 및 환불이 지연될 수 있습니다.
                <br />
                <br />
                제19조(판매자의 판매활동)
                <br />
                1.물품 및 용역의 판매는 판매자 등록이 완료됨과 동시에 가능하며, 이를 위해서 판매자는 물품 및 용역에 관한 정보를 직접 등록, 관리하여야 합니다. 이때 물품 및 용역의 판매가격은 판매자가 스스로 결정합니다.
                <br />
                2.판매자는 재고 수량 등 수시로 변동되는 사항에 대한 데이터를 적절히 관리하여야 하며, 데이터를 허위로 기재할 수 없습니다.
                <br />
                3.판매자는 전자상거래법 등 물품 및 용역의 판매와 관련하여 법령이 요구하는 사항을 준수하여야 합니다.
                <br />
                4.판매자는 회사의 서면에 의한 사전 승인 없이 회사의 상호나 로고 등을 사용할 수 없습니다.
                <br />
                5.판매자는 회사를 통하지 않고 구매자에게 직접 물품을 판매하거나 이를 유도하여서는 아니되며, 이를 위반할 경우 회사는 당해 판매자를 탈퇴시킬 수 있습니다.
                <br />
                6.판매자는 판매된 물품 및 용역에 대한 보증 서비스를 자신의 책임과 비용으로 실시하여야 합니다.
                <br />
                7.판매자는 자신의 판매자 정보란에 회사가 정하는 절차에 따라 인증 받은 유선전화 또는 휴대폰 번호를 대표번호로서 설정하고 항상 최신 정보로서 유지하여야 합니다. 판매자가 본 항의 의무를 이행하지 않을 경우 회사는 이행 완료 시까지 해당 판매자의 물품 등록과 편집을 제한할 수 있습니다.
                <br />
                <br />
                제6장 분쟁의 해결
                <br />
                <br />
                제20조(분쟁의 조정)
                <br />
                1.회사는 회원 상호간 또는 회원과 제3자 사이의 불만처리 및 분쟁조정을 하기 위하여 고객센터를 운영 합니다.
                <br />
                2.회사는 고객센터를 통하여 회원으로부터 제기되는 불만사항 및 의견이 정당하다고 판단되는 경우 이를 신속하게 처리하며, 3영업일 이내에 그 진행경과를 알리고 10영업일 이내에 조사결과와 처리방안을 통보합니다.
                <br />
                3.고객센터의 분쟁조정 시 회원은 신의성실의 원칙에 따라 성실히 응하여야 합니다.
                <br />
                <br />
                제21조(준거법 및 관할법원)
                <br />
                본 약관과 회사와 회원 간의 서비스 이용 계약, 회원 상호간의 물품 거래에 관하여는 대한민국 법령이 적용되며, 이에 관하여 발생한 분쟁을 해결하기 위한 소송이나 절차는 회사의 본점 소재지를 관할하는 법원에 따르는 것으로 합니다.
                <br />
                <br />
                이 약관은 2022년 3월 11일부터 시행합니다.
                <br />
            </Contents>
        </Container>
    );
}

const Container = styled.div`
    width: 1280px;
    margin: 120px auto;
`;

const Title = styled.div`
    text-align: center;
    font-size: 24px;
    font-weight: bold;
`;

const Contents = styled.div`
    margin-top: 40px;
`;

export default Terms;
